In [4]:
#import pachages and modules
import pandas as pd
import os

In [5]:
#school_data_to_load = 'resources/schools_complete.csv'
#students_data_to_load = 'resources/students_complete.csv'

In [6]:
#import data csv
schools_data = pd.read_csv('resources/schools_complete.csv')
students_data = pd.read_csv('resources/students_complete.csv')

In [7]:
schools_data_df =pd.DataFrame(schools_data)
schools_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [8]:
students_data_df = pd.DataFrame(students_data)
students_data_df.head()

#read and store files into pandas dataframe merge data frames into one
#school_data_complete = pd.merge(students_data,schools_data, how="left", on = ["school_name","school_name"])
#df = school_data_complete

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [9]:
schools_data_df.describe()

       School ID         size        budget
count  15.000000    15.000000  1.500000e+01
mean    7.000000  2611.333333  1.643295e+06
std     4.472136  1420.915282  9.347763e+05
min     0.000000   427.000000  2.480870e+05
25%     3.500000  1698.000000  1.046265e+06
50%     7.000000  2283.000000  1.319574e+06
75%    10.500000  3474.000000  2.228999e+06
max    14.000000  4976.000000  3.124928e+06

In [10]:
students_data_df.describe()

         Student ID  reading_score    math_score
count  39170.000000    39170.00000  39170.000000
mean   19584.500000       81.87784     78.985371
std    11307.549359       10.23958     12.309968
min        0.000000       63.00000     55.000000
25%     9792.250000       73.00000     69.000000
50%    19584.500000       82.00000     79.000000
75%    29376.750000       91.00000     89.000000
max    39169.000000       99.00000     99.000000

In [12]:
merge_df = pd.merge(schools_data_df, students_data_df, on ="school_name", how = "left")
merge_df

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84
...,...,...,...,...,...,...,...,...,...,...,...
39165,14,Thomas High School,Charter,1635,1043130,39165,Donna Howard,F,12th,99,90
39166,14,Thomas High School,Charter,1635,1043130,39166,Dawn Bell,F,10th,95,70
39167,14,Thomas High School,Charter,1635,1043130,39167,Rebecca Tanner,F,9th,73,84
39168,14,Thomas High School,Charter,1635,1043130,39168,Desiree Kidd,F,10th,99,90
39169,14,Thomas High School,Charter,1635,1043130,39169,Carolyn Jackson,F,11th,95,75

In [13]:
district_summary = []

In [14]:
#find the total number of schools
total_schools = schools_data_df['school_name'].count()
total_schools

15

In [15]:
#find the total number of students
total_students = students_data_df['student_name'].count()
total_students

39170

In [16]:
#find the total budget for all of the schools
total_budget = schools_data_df['budget'].sum()
total_budget

24649428

In [17]:
#find average math scores for the district
math_average = merge_df['math_score'].mean()
math_average

78.98537145774827

In [18]:
#find percentage passing math
sort_stu_pass_math =merge_df[merge_df['math_score']>=70]
num_stu_pass_math =sort_stu_pass_math ['math_score'].count()
percent_pass_math=num_stu_pass_math / total_students * 100
percent_pass_math

74.9808526933878

In [19]:
#find total reading scores for the district
read_average = merge_df['reading_score'].mean()
read_average

81.87784018381414

In [20]:
#find percetage passing reading
sort_stu_pass_read =merge_df[merge_df['reading_score']>=70]
num_stu_pass_read =sort_stu_pass_read ['reading_score'].count()
percent_pass_read=num_stu_pass_read / total_students * 100
percent_pass_read

85.80546336482001

In [39]:
#find overall average score for district
#overall_pass_rate =merge_df[merge_df['read_average','math_average']].value_sum()
overall_pass_rate = ((read_average + math_average)/2)
overall_pass_rate

80.43160582078121

In [33]:
#merge_df[['size','budget']].head()

In [34]:
#unique_budget = merge_df['budget'].unique()
#unique_budget

In [35]:
#unique_budget_total = unique_budget.sum()
#unique_budget_total

In [36]:
#count = merge_df['gender'].value_counts()
#count

In [40]:
District_summary_df = pd.DataFrame({
    'Total Schools':[total_schools],
    'Total Students':[total_students],
    'Total Budget':[total_budget],
    'Average Math Score':[math_average],
    'Average Reading Score':[read_average],
    '% Passing Math':[percent_pass_math],
    '% Passing Reading':[percent_pass_read],
    '% Overall Passing Rate':[overall_pass_rate]})
District_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,80.431606

In [ ]:
School_summary_df = pd.DataFrame()